# Data Cleaning and Preparation

In [1]:
from pathlib import Path

import pandas as pd

In [203]:
data_dir = Path("../data")

In [204]:
csv_sp500 = data_dir / 'SP500.csv'
csv_bist100 = data_dir / 'BIST100.csv'
csv_bist_all = data_dir / 'BISTALL.csv'
csv_gold = data_dir / 'Gold.csv'
csv_btc_eth = data_dir / 'BTCETH.csv'
csv_exchange_rate = data_dir / 'EXCHANGE.csv'
csv_tl_inflation = data_dir / 'TLINF.csv'
csv_interest_rate = data_dir / 'TLDEPO.csv'

## Helper Functions

In [205]:
from pandas import DataFrame


def add_date_filed(df: DataFrame, reference_field: str = 'Date', dayfirst: bool = True):
    if not reference_field in df.columns:
        raise ValueError(f"{reference_field} dose not exists in DataFrame")
    df['date'] = pd.to_datetime(df[f"{reference_field}"], dayfirst=dayfirst)
    return df


def add_quarter_filed(df: DataFrame, reference_field: str | None = None):
    if reference_field is not None:
        if not reference_field in df.columns:
            raise ValueError(f"{reference_field} dose not exists in DataFrame")
    df['quarter'] = df['date'].dt.to_period('Q')
    return df


def remove_unnamed_columns(_df, _range=(0, 5)):
    try:
        _df.drop(['Unnamed: ' + str(each) for each in range(_range)], axis=1)
    except KeyError:
        pass
    finally:
        return _df

## Handle Data Structure

### S&P500

In [206]:
df_sp500 = pd.read_csv(csv_sp500)

In [207]:
df_sp500

             Date  Index Market cap (m$)
0      31.03.1964     79         357,907
1       1.04.1964     79         357,907
2       2.04.1964     80         357,907
3       3.04.1964     80         357,907
4       6.04.1964     80         357,907
...           ...    ...             ...
15314  12.12.2022  3,991      33,536,670
15315  13.12.2022  4,020      33,781,200
15316  14.12.2022  3,995      33,576,690
15317  15.12.2022  3,896      32,739,940
15318  16.12.2022  3,852      32,375,300

[15319 rows x 3 columns]

In [208]:
df_sp500 = add_date_filed(df_sp500)

In [209]:
df_sp500

             Date  Index Market cap (m$)       date
0      31.03.1964     79         357,907 1964-03-31
1       1.04.1964     79         357,907 1964-04-01
2       2.04.1964     80         357,907 1964-04-02
3       3.04.1964     80         357,907 1964-04-03
4       6.04.1964     80         357,907 1964-04-06
...           ...    ...             ...        ...
15314  12.12.2022  3,991      33,536,670 2022-12-12
15315  13.12.2022  4,020      33,781,200 2022-12-13
15316  14.12.2022  3,995      33,576,690 2022-12-14
15317  15.12.2022  3,896      32,739,940 2022-12-15
15318  16.12.2022  3,852      32,375,300 2022-12-16

[15319 rows x 4 columns]

In [210]:
# df = pd.DataFrame(
#     columns=['date', 'quarter', 'sp500', 'sp500cap', 'bist100', 'bist100cap', 'bistall', 'bistallcap', 'btc', 'eth',
#              'gold', 'rate', 'cpi', 'usdtry', 'eurtry'])

In [211]:
df = pd.DataFrame()

In [212]:
df['date'] = df_sp500.date

In [213]:
df

            date
0     1964-03-31
1     1964-04-01
2     1964-04-02
3     1964-04-03
4     1964-04-06
...          ...
15314 2022-12-12
15315 2022-12-13
15316 2022-12-14
15317 2022-12-15
15318 2022-12-16

[15319 rows x 1 columns]

In [214]:
df = df.merge(df_sp500, on='date', how='outer', validate='one_to_one').rename(
    columns={'Index': 'sp500', 'Market cap (m$)': 'sp500cap'})

In [215]:
df

            date        Date  sp500    sp500cap
0     1964-03-31  31.03.1964     79     357,907
1     1964-04-01   1.04.1964     79     357,907
2     1964-04-02   2.04.1964     80     357,907
3     1964-04-03   3.04.1964     80     357,907
4     1964-04-06   6.04.1964     80     357,907
...          ...         ...    ...         ...
15314 2022-12-12  12.12.2022  3,991  33,536,670
15315 2022-12-13  13.12.2022  4,020  33,781,200
15316 2022-12-14  14.12.2022  3,995  33,576,690
15317 2022-12-15  15.12.2022  3,896  32,739,940
15318 2022-12-16  16.12.2022  3,852  32,375,300

[15319 rows x 4 columns]

In [216]:
df = df.drop(['Date'], axis=1)

In [217]:
df

            date  sp500    sp500cap
0     1964-03-31     79     357,907
1     1964-04-01     79     357,907
2     1964-04-02     80     357,907
3     1964-04-03     80     357,907
4     1964-04-06     80     357,907
...          ...    ...         ...
15314 2022-12-12  3,991  33,536,670
15315 2022-12-13  4,020  33,781,200
15316 2022-12-14  3,995  33,576,690
15317 2022-12-15  3,896  32,739,940
15318 2022-12-16  3,852  32,375,300

[15319 rows x 3 columns]

In [218]:
df = df.reindex(columns=[
    'date',
    'sp500',
    'sp500cap'
])

In [219]:
df

            date  sp500    sp500cap
0     1964-03-31     79     357,907
1     1964-04-01     79     357,907
2     1964-04-02     80     357,907
3     1964-04-03     80     357,907
4     1964-04-06     80     357,907
...          ...    ...         ...
15314 2022-12-12  3,991  33,536,670
15315 2022-12-13  4,020  33,781,200
15316 2022-12-14  3,995  33,576,690
15317 2022-12-15  3,896  32,739,940
15318 2022-12-16  3,852  32,375,300

[15319 rows x 3 columns]

### BIST100

In [220]:
df_bist100 = pd.read_csv(csv_bist100)

In [221]:
df_bist100

,Date,Index,Market cap (m TL),Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50,Unnamed: 51,Unnamed: 52,Unnamed: 53,Unnamed: 54,Unnamed: 55
0,4.01.1988,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5.01.1988,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,6.01.1988,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,7.01.1988,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,8.01.1988,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9117,13.12.2022,"5,256","4,209,786",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9118,14.12.2022,"5,067","4,067,326",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9119,15.12.2022,"5,189","4,180,713",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9120,16.12.2022,"5,214","4,220,547",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9121,19.12.2022,"5,392","4,369,087",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [222]:
columns_to_delete = [f"Unnamed: {each}" for each in range(3, 56)]

In [223]:
df_bist100 = df_bist100.drop(columns=columns_to_delete)

In [224]:
df_bist100

            Date    Index Market cap (m TL)
0      4.01.1988       0                 1
1      5.01.1988       0                 1
2      6.01.1988       0                 1
3      7.01.1988       0                 1
4      8.01.1988       0                 1
...          ...      ...               ...
9117  13.12.2022   5,256         4,209,786
9118  14.12.2022   5,067         4,067,326
9119  15.12.2022   5,189         4,180,713
9120  16.12.2022   5,214         4,220,547
9121  19.12.2022   5,392         4,369,087

[9122 rows x 3 columns]

In [225]:
df_bist100 = add_date_filed(df_bist100)

In [226]:
df_bist100

            Date    Index Market cap (m TL)       date
0      4.01.1988       0                 1  1988-01-04
1      5.01.1988       0                 1  1988-01-05
2      6.01.1988       0                 1  1988-01-06
3      7.01.1988       0                 1  1988-01-07
4      8.01.1988       0                 1  1988-01-08
...          ...      ...               ...        ...
9117  13.12.2022   5,256         4,209,786  2022-12-13
9118  14.12.2022   5,067         4,067,326  2022-12-14
9119  15.12.2022   5,189         4,180,713  2022-12-15
9120  16.12.2022   5,214         4,220,547  2022-12-16
9121  19.12.2022   5,392         4,369,087  2022-12-19

[9122 rows x 4 columns]

In [227]:
df = df.merge(df_bist100, on='date', how='outer').rename(
    columns={'Index': 'bist100', 'Market cap (m TL)': 'bist100cap'})

In [228]:
df

            date  sp500    sp500cap        Date  bist100   bist100cap
0     1964-03-31     79     357,907         NaN      NaN          NaN
1     1964-04-01     79     357,907         NaN      NaN          NaN
2     1964-04-02     80     357,907         NaN      NaN          NaN
3     1964-04-03     80     357,907         NaN      NaN          NaN
4     1964-04-06     80     357,907         NaN      NaN          NaN
...          ...    ...         ...         ...      ...          ...
15316 2022-12-13  4,020  33,781,200  13.12.2022   5,256    4,209,786
15317 2022-12-14  3,995  33,576,690  14.12.2022   5,067    4,067,326
15318 2022-12-15  3,896  32,739,940  15.12.2022   5,189    4,180,713
15319 2022-12-16  3,852  32,375,300  16.12.2022   5,214    4,220,547
15320 2022-12-19    NaN         NaN  19.12.2022   5,392    4,369,087

[15321 rows x 6 columns]

In [229]:
df = df.reindex(columns=[
    'date',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap'
])

In [230]:
df

            date  sp500    sp500cap  bist100   bist100cap
0     1964-03-31     79     357,907      NaN          NaN
1     1964-04-01     79     357,907      NaN          NaN
2     1964-04-02     80     357,907      NaN          NaN
3     1964-04-03     80     357,907      NaN          NaN
4     1964-04-06     80     357,907      NaN          NaN
...          ...    ...         ...      ...          ...
15316 2022-12-13  4,020  33,781,200   5,256    4,209,786
15317 2022-12-14  3,995  33,576,690   5,067    4,067,326
15318 2022-12-15  3,896  32,739,940   5,189    4,180,713
15319 2022-12-16  3,852  32,375,300   5,214    4,220,547
15320 2022-12-19    NaN         NaN   5,392    4,369,087

[15321 rows x 5 columns]

### BISTALL

In [231]:
df_bistall = pd.read_csv(csv_bist_all)

In [232]:
df_bistall

            Code    Index Market cap (m TL)
0      2.01.1997      10             2,992
1      3.01.1997      10             3,084
2      6.01.1997      11             3,143
3      7.01.1997      11             3,235
4      8.01.1997      11             3,408
...          ...      ...               ...
6768  13.12.2022   5,916         5,570,492
6769  14.12.2022   5,714         5,393,263
6770  15.12.2022   5,836         5,521,100
6771  16.12.2022   5,870         5,577,080
6772  19.12.2022   6,028         5,727,575

[6773 rows x 3 columns]

In [233]:
df_bistall = add_date_filed(df_bistall, reference_field='Code')

In [234]:
df_bistall

            Code    Index Market cap (m TL)       date
0      2.01.1997      10             2,992  1997-01-02
1      3.01.1997      10             3,084  1997-01-03
2      6.01.1997      11             3,143  1997-01-06
3      7.01.1997      11             3,235  1997-01-07
4      8.01.1997      11             3,408  1997-01-08
...          ...      ...               ...        ...
6768  13.12.2022   5,916         5,570,492  2022-12-13
6769  14.12.2022   5,714         5,393,263  2022-12-14
6770  15.12.2022   5,836         5,521,100  2022-12-15
6771  16.12.2022   5,870         5,577,080  2022-12-16
6772  19.12.2022   6,028         5,727,575  2022-12-19

[6773 rows x 4 columns]

In [235]:
df = df.merge(df_bistall, on='date', how='outer').rename(
    columns={'Index': 'bistall', 'Market cap (m TL)': 'bistallcap'})

In [236]:
df

,date,sp500,sp500cap,bist100,bist100cap,Code,bistall,bistallcap
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
15316,2022-12-13,"4,020","33,781,200","5,256","4,209,786",13.12.2022,"5,916","5,570,492"
15317,2022-12-14,"3,995","33,576,690","5,067","4,067,326",14.12.2022,"5,714","5,393,263"
15318,2022-12-15,"3,896","32,739,940","5,189","4,180,713",15.12.2022,"5,836","5,521,100"
15319,2022-12-16,"3,852","32,375,300","5,214","4,220,547",16.12.2022,"5,870","5,577,080"
15320,2022-12-19,NaN,NaN,"5,392","4,369,087",19.12.2022,"6,028","5,727,575"

In [237]:
df = df.reindex(columns=[
    'date',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap'
])

In [238]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
15316,2022-12-13,"4,020","33,781,200","5,256","4,209,786","5,916","5,570,492"
15317,2022-12-14,"3,995","33,576,690","5,067","4,067,326","5,714","5,393,263"
15318,2022-12-15,"3,896","32,739,940","5,189","4,180,713","5,836","5,521,100"
15319,2022-12-16,"3,852","32,375,300","5,214","4,220,547","5,870","5,577,080"
15320,2022-12-19,NaN,NaN,"5,392","4,369,087","6,028","5,727,575"

### BTC & ETH

In [239]:
df_btc_eth = pd.read_csv(csv_btc_eth)

In [240]:
df_btc_eth

            Date   Bitcoin Ethereum
0      4.11.2014      324       NaN
1      5.11.2014      329       NaN
2      6.11.2014      338       NaN
3      7.11.2014      349       NaN
4      8.11.2014      341       NaN
...          ...       ...      ...
2858  21.11.2022   15,787    1,142
2859  22.11.2022   16,190    1,108
2860  23.11.2022   16,611    1,135
2861  24.11.2022   16,604    1,183
2862  25.11.2022   16,522    1,204

[2863 rows x 3 columns]

In [241]:
df_btc_eth = add_date_filed(df_btc_eth)

In [242]:
df_btc_eth

            Date   Bitcoin Ethereum       date
0      4.11.2014      324       NaN 2014-11-04
1      5.11.2014      329       NaN 2014-11-05
2      6.11.2014      338       NaN 2014-11-06
3      7.11.2014      349       NaN 2014-11-07
4      8.11.2014      341       NaN 2014-11-08
...          ...       ...      ...        ...
2858  21.11.2022   15,787    1,142  2022-11-21
2859  22.11.2022   16,190    1,108  2022-11-22
2860  23.11.2022   16,611    1,135  2022-11-23
2861  24.11.2022   16,604    1,183  2022-11-24
2862  25.11.2022   16,522    1,204  2022-11-25

[2863 rows x 4 columns]

In [243]:
df = df.merge(df_btc_eth, on='date', how='outer').rename(
    columns={'Bitcoin': 'btc', 'Ethereum': 'eth'})

In [244]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,Date,btc,eth
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,6.11.2022,"20,926","1,628"
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,12.11.2022,"16,799","1,287"
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,13.11.2022,"16,353","1,255"
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,19.11.2022,"16,712","1,212"
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,20.11.2022,"16,292","1,218"

In [245]:
df = df.reindex(columns=[
    'date',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap',
    'btc',
    'eth'
])

In [246]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628"
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287"
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255"
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212"
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218"

### Gold

In [247]:
df_gold = pd.read_csv(csv_gold)

In [248]:
df_gold

             Date Price ($/t oz)
0       3.01.1968            35
1       4.01.1968            35
2       5.01.1968            35
3       8.01.1968            35
4       9.01.1968            35
...           ...            ...
14334  13.12.2022         1,813
14335  14.12.2022         1,811
14336  15.12.2022         1,777
14337  16.12.2022         1,790
14338  19.12.2022         1,786

[14339 rows x 2 columns]

In [249]:
df_gold = add_date_filed(df_gold)

In [250]:
df_gold

             Date Price ($/t oz)       date
0       3.01.1968            35  1968-01-03
1       4.01.1968            35  1968-01-04
2       5.01.1968            35  1968-01-05
3       8.01.1968            35  1968-01-08
4       9.01.1968            35  1968-01-09
...           ...            ...        ...
14334  13.12.2022         1,813  2022-12-13
14335  14.12.2022         1,811  2022-12-14
14336  15.12.2022         1,777  2022-12-15
14337  16.12.2022         1,790  2022-12-16
14338  19.12.2022         1,786  2022-12-19

[14339 rows x 3 columns]

In [251]:
df = df.merge(df_gold, on='date', how='outer').rename(
    columns={'Price ($/t oz)': 'gold'})

In [252]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,Date,gold
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN

In [253]:
df = df.reindex(columns=[
    'date',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap',
    'btc',
    'eth',
    'gold'
])

In [254]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN

### Deposit Interest Rate

In [255]:
df_rate = pd.read_csv(csv_interest_rate)

In [256]:
df_rate

     Quarter  Deposit rate
0    Q4 1978          6.00
1    Q1 1979          6.00
2    Q2 1979          7.33
3    Q3 1979          8.00
4    Q4 1979          8.00
..       ...           ...
167  Q3 2020         12.52
168  Q4 2020         17.42
169  Q1 2021         19.72
170  Q2 2021         20.25
171  Q3 2021         20.00

[172 rows x 2 columns]

In [257]:
# df_rate['quarter_dt']=pd.to_datetime(df_rate.Quarter)

In [258]:
d = "Q4 1978"

In [259]:
list_d = d.strip('').split(' ')

In [260]:
list_d

['Q4', '1978']

In [261]:
str_d = list_d[1] + list_d[0]

In [262]:
str_d

'1978Q4'

In [263]:
def format_quarter(v_in: str) -> str:
    list_v = v_in.strip('').split(' ')
    str_v = list_v[1] + list_v[0]
    return str_v

In [264]:
df_rate['quarter-t'] = df_rate.Quarter.apply(format_quarter)

In [265]:
df_rate

     Quarter  Deposit rate quarter-t
0    Q4 1978          6.00    1978Q4
1    Q1 1979          6.00    1979Q1
2    Q2 1979          7.33    1979Q2
3    Q3 1979          8.00    1979Q3
4    Q4 1979          8.00    1979Q4
..       ...           ...       ...
167  Q3 2020         12.52    2020Q3
168  Q4 2020         17.42    2020Q4
169  Q1 2021         19.72    2021Q1
170  Q2 2021         20.25    2021Q2
171  Q3 2021         20.00    2021Q3

[172 rows x 3 columns]

In [266]:
df_rate['quarter'] = pd.PeriodIndex(df_rate['quarter-t'], freq='Q')

In [267]:
df_rate

     Quarter  Deposit rate quarter-t quarter
0    Q4 1978          6.00    1978Q4  1978Q4
1    Q1 1979          6.00    1979Q1  1979Q1
2    Q2 1979          7.33    1979Q2  1979Q2
3    Q3 1979          8.00    1979Q3  1979Q3
4    Q4 1979          8.00    1979Q4  1979Q4
..       ...           ...       ...     ...
167  Q3 2020         12.52    2020Q3  2020Q3
168  Q4 2020         17.42    2020Q4  2020Q4
169  Q1 2021         19.72    2021Q1  2021Q1
170  Q2 2021         20.25    2021Q2  2021Q2
171  Q3 2021         20.00    2021Q3  2021Q3

[172 rows x 4 columns]

In [268]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN

In [269]:
df = add_quarter_filed(df)

In [270]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,quarter
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q1
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2
...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,2022Q4
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,2022Q4
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,2022Q4
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,2022Q4
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,2022Q4

In [271]:
df = df.merge(df_rate, on='quarter', how='outer').rename(
    columns={'Deposit rate': 'rate'})

In [272]:
df

,date,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,quarter,Quarter,rate,quarter-t
0,1964-03-31,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q1,NaN,NaN,NaN
1,1964-04-01,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2,NaN,NaN,NaN
2,1964-04-02,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2,NaN,NaN,NaN
3,1964-04-03,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2,NaN,NaN,NaN
4,1964-04-06,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964Q2,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,2022Q4,NaN,NaN,NaN
16076,2022-11-12,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,2022Q4,NaN,NaN,NaN
16077,2022-11-13,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,2022Q4,NaN,NaN,NaN
16078,2022-11-19,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,2022Q4,NaN,NaN,NaN
16079,2022-11-20,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,2022Q4,NaN,NaN,NaN

In [273]:
df = df.reindex(columns=[
    'date',
    'quarter',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap',
    'btc',
    'eth',
    'gold',
    'rate'
])

In [274]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN

### CPI

In [275]:
df_cpi = pd.read_csv(csv_tl_inflation)

In [276]:
df_cpi

            Month  CPI (%YOY)
0      January-95      125.90
1     February-95      122.40
2        March-95      119.70
3        April-95       88.40
4          May-95       79.80
..            ...         ...
328        May-22       57.92
329       June-22       64.59
330       July-22       69.94
331     August-22       70.60
332  September-22       67.73

[333 rows x 2 columns]

In [277]:
df_cpi['date-t'] = pd.to_datetime(df_cpi['Month'], format="%B-%y")

In [278]:
df_cpi['quarter'] = pd.PeriodIndex(df_cpi['date-t'], freq='Q')

In [279]:
df_cpi

            Month  CPI (%YOY)     date-t quarter
0      January-95      125.90 1995-01-01  1995Q1
1     February-95      122.40 1995-02-01  1995Q1
2        March-95      119.70 1995-03-01  1995Q1
3        April-95       88.40 1995-04-01  1995Q2
4          May-95       79.80 1995-05-01  1995Q2
..            ...         ...        ...     ...
328        May-22       57.92 2022-05-01  2022Q2
329       June-22       64.59 2022-06-01  2022Q2
330       July-22       69.94 2022-07-01  2022Q3
331     August-22       70.60 2022-08-01  2022Q3
332  September-22       67.73 2022-09-01  2022Q3

[333 rows x 4 columns]

In [280]:
import numpy as np


# get the corresponding cpi for that given day:
def get_cpi(v):
    given = v.to_pydatetime().date()
    given = str(given)
    year_month = given[:-2]
    day = year_month + '01'
    result = df_cpi.loc[df_cpi['date-t'] == day]['CPI (%YOY)']
    if result.count() == 0:
        return np.nan
    else:
        return result.iloc[-1]

In [281]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN

In [282]:
df['cpi'] = df.date.apply(get_cpi)

In [283]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate,cpi
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN,NaN

In [284]:
df = df.reindex(columns=[
    'date',
    'quarter',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap',
    'btc',
    'eth',
    'gold',
    'rate',
    'cpi'
])

In [285]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate,cpi
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN,NaN

### Exchange Rates

In [286]:
df_exchange = pd.read_csv(csv_exchange_rate)

In [287]:
df_exchange

           Date    TL/USD    TL/Euro
0     31.12.1987     0.001        NaN
1      1.01.1988     0.001        NaN
2      4.01.1988     0.001        NaN
3      5.01.1988     0.001        NaN
4      6.01.1988     0.001        NaN
...          ...       ...        ...
9118  13.12.2022    18.575     19.837
9119  14.12.2022    18.628     19.837
9120  15.12.2022    18.642     19.852
9121  16.12.2022    18.639     19.786
9122  19.12.2022    18.653     19.730

[9123 rows x 3 columns]

In [288]:
df_exchange['date'] = pd.to_datetime(df_exchange["Date "], dayfirst=True)

In [289]:
df_exchange

           Date    TL/USD    TL/Euro        date
0     31.12.1987     0.001        NaN 1987-12-31
1      1.01.1988     0.001        NaN 1988-01-01
2      4.01.1988     0.001        NaN 1988-01-04
3      5.01.1988     0.001        NaN 1988-01-05
4      6.01.1988     0.001        NaN 1988-01-06
...          ...       ...        ...        ...
9118  13.12.2022    18.575     19.837 2022-12-13
9119  14.12.2022    18.628     19.837 2022-12-14
9120  15.12.2022    18.642     19.852 2022-12-15
9121  16.12.2022    18.639     19.786 2022-12-16
9122  19.12.2022    18.653     19.730 2022-12-19

[9123 rows x 4 columns]

In [290]:
df_exchange.columns

Index(['Date ', ' TL/USD ', ' TL/Euro ', 'date'], dtype='object')

In [291]:
df = df.merge(df_exchange, on='date', how='outer').rename(
    columns={' TL/USD ': 'usdtry', ' TL/Euro ': 'eurtry'})

In [292]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate,cpi,Date,usdtry,eurtry
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN,NaN,NaN,NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN,NaN,NaN,NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN,NaN,NaN,NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN,NaN,NaN,NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN,NaN,NaN,NaN,NaN

In [293]:
df = df.reindex(columns=[
    'date',
    'quarter',
    'sp500',
    'sp500cap',
    'bist100',
    'bist100cap',
    'bistall',
    'bistallcap',
    'btc',
    'eth',
    'gold',
    'rate',
    'cpi',
    'usdtry',
    'eurtry'
])

In [294]:
df

,date,quarter,sp500,sp500cap,bist100,bist100cap,bistall,bistallcap,btc,eth,gold,rate,cpi,usdtry,eurtry
0,1964-03-31,1964Q1,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1964-04-01,1964Q2,79,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1964-04-02,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1964-04-03,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964-04-06,1964Q2,80,"357,907",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16075,2022-11-06,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"20,926","1,628",NaN,NaN,NaN,NaN,NaN
16076,2022-11-12,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,799","1,287",NaN,NaN,NaN,NaN,NaN
16077,2022-11-13,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,353","1,255",NaN,NaN,NaN,NaN,NaN
16078,2022-11-19,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,712","1,212",NaN,NaN,NaN,NaN,NaN
16079,2022-11-20,2022Q4,NaN,NaN,NaN,NaN,NaN,NaN,"16,292","1,218",NaN,NaN,NaN,NaN,NaN

In [295]:
df.columns

Index(['date', 'quarter', 'sp500', 'sp500cap', 'bist100', 'bist100cap',
       'bistall', 'bistallcap', 'btc', 'eth', 'gold', 'rate', 'cpi', 'usdtry',
       'eurtry'],
      dtype='object')

In [296]:
data_csv = data_dir / 'data.csv'
data_hdf = data_dir / 'data.hdf5'

In [297]:
df.to_csv(data_csv, index=False)

In [298]:
# write data to sqlite3

In [299]:
'''
import pandas as pd
import sqlite3 as sq

table_name = "data" # table and file name

conn = sq.connect('{}.sqlite'.format(table_name)) # creates file
df.to_sql(table_name, conn, if_exists='replace', index=False) # writes to file
conn.close() # good practice: close connection
'''

'\nimport pandas as pd\nimport sqlite3 as sq\n\ntable_name = "data" # table and file name\n\nconn = sq.connect(\'{}.sqlite\'.format(table_name)) # creates file\ndf.to_sql(table_name, conn, if_exists=\'replace\', index=False) # writes to file\nconn.close() # good practice: close connection\n'

In [300]:
# to read data
'''
conn = sq.connect('{}.sqlite'.format(table_name))
df = pd.read_sql('select * from {}'.format(table_name), conn)
conn.close()
'''

"\nconn = sq.connect('{}.sqlite'.format(table_name))\ndf = pd.read_sql('select * from {}'.format(table_name), conn)\nconn.close()\n"